backend-api/app/Controllers/Api/AuthController.php

    public function login()
    {
        $username = $this->request->getJSON()->username ?? '';
        $password = $this->request->getJSON()->password ?? '';

        $model = new UserModel();
        $user = $model->where('username', $username)->first();

        if (!$user || !password_verify($password, $user['password'])) {
            return $this->response->setStatusCode(401)->setJSON([
                'status' => false,
                'message' => 'Username atau password salah'
            ]);
        }

        $token = bin2hex(random_bytes(32));
        $model->update($user['id'], ['token' => $token]);
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
UPDATE `users` SET `token` = 'e7bc56720739aee084a7cb0ae23643e410a39b59fa2211f85ea1ff99a109f9d9'
WHERE `users`.`id` IN ('1')