backend-api/app/Controllers/Api/Supplier.php

    public function index() {
        return $this->respond((new SupplierModel())->findAll());
---
SELECT *
FROM `supplier`