app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $token = $request->getHeaderLine('Authorization');
        $token = str_replace('Bearer ', '', $token);

        if (empty($token)) {
            return response()->setStatusCode(401)->setJSON([
                'status' => false,
                'message' => 'Token tidak ditemukan'
            ]);
        }

        $model = new UserModel();
        $user = $model->where('token', $token)->first();
---
SELECT *
FROM `users`
WHERE `token` = '529f72b423d5586ddc71f304605d06646c60442854beb0d381a8ee06ed060717'
 LIMIT 1