app/Models/BarangModel.php

SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
LEFT JOIN `kategori` ON `kategori`.`id` = `barang`.`id_kategori`
---
    public function getBarangWithKategori()
    {
        return $this->select('barang.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id = barang.id_kategori', 'left')
                    ->findAll();